"""
描述
牛牛拿到了一个字符串。
他每次“点击”，可以把字符串中相邻两个相同字母消除，例如，字符串"abbc"点击后可以生成"ac"。
但相同而不相邻、不相同的相邻字母都是不可以被消除的。
牛牛想把字符串变得尽可能短。他想知道，当他点击了足够多次之后，字符串的最终形态是什么？
输入描述：
一个字符串，仅由小写字母组成。（字符串长度不大于300000）
输出描述：
一个字符串，为“点击消除”后的最终形态。若最终的字符串为空串，则输出0。

step1：创建一个空栈；输入元素；
step2：遍历s，如果栈内元素为0，则直接添加；否则，如果栈内最后一个元素与i相等，则弹出该元素；否则直接添加；
step3：如果栈长度为0，打印0；否则，逐个打印；
"""

import sys

s = input()
stack = []
for val in s:
    if len(stack)==0 or stack[-1]!=val:
        stack.append(val)
    elif stack[-1] == val:
        stack.pop()
if len(stack)==0:
    print(0)
else:
    print("".join(stack))
